AcDbTextStyleTableRecord.setFont(System.Char!System.Runtime.CompilerServices.IsConst*,System.Boolean,System.Boolean,Charset,Autodesk.AutoCAD.PAL.FontUtils.FontPitch,Autodesk.AutoCAD.PAL.FontUtils.FontFamily,System.Boolean)
This method sets the TextStyleTableRecord to use the Windows font as specified by the passed in arguments.
If pTypeFace == NULL or points to an empty string, and the other arguments are Adesk::kFalse or 0 (as appropriate),
then all existing Windows font information in this TextStyleTableRecord is removed from the record.
WARNING: This method should not be used to set an old style SHX font. To set the TextStyleTableRecord to use
an SHX font, you need to use the AcDbTextStyleTableRecord::setFileName() method.
pTypeface: Input pointer to the font file name string of the desired font
bold: Input Boolean indicating whether or not the font is to be bold
italic: Input Boolean indicating whether or not the font is to be italic
charset: Input integer that is the Windows character set identifier
pitch: Input indicating the pitch being used
family: Input indicating the family being used
bAllowMissingFont: Input bool indicating whether or not to allow the set to succeed if the font is not installed on the computer
Returns: Returns Acad::eOk if successful and Acad::eInvalidInput if bAllowMissingFont is false and the font
is not installed on the system.